app/controllers/brew_tags_controller.rb

SELECT * FROM "brew_tags" WHERE (can_show='Yes') ORDER BY name
---
  def index
    @brew_tags = BrewTag.all