app/controllers/labels_controller.rb

SELECT * FROM "labels" WHERE (global = 'Y')
SELECT * FROM "brew_tags" WHERE (can_show='Yes') ORDER BY name
---
  def index
    if params[:brew_tag_id].blank?
      @labels = Label.all(:conditions => "global = 'Y'")
    else
      @labels = Label.all(:conditions => ["brew_tag_id = ?", BrewTag.find_by_name(unescape_url(params[:brew_tag_id])).id])

SELECT * FROM "labels" WHERE (global = 'Y' and name = 'Deleted/Obsolete') LIMIT 1
---
  def show
    if params[:brew_tag_id].blank?
      @label = Label.find(:first, :conditions => ["global = 'Y' and name = ?", unescape_url(params[:id])])

SELECT * FROM "labels" WHERE (name = 'Deleted/Obsolete' AND global='Y') LIMIT 1
---
  def edit
    if params[:brew_tag_id].blank?
      @label = Label.find(:first, :conditions => ["name = ? AND global='Y'", unescape_url(params[:id])])

SELECT * FROM "labels" WHERE ("labels"."id" = 23)
UPDATE "labels" SET "can_show" = 'Yes', "updated_at" = '2012-10-29 10:05:22.217780', "is_track_time" = 'No' WHERE "id" = 23
---
  def update
    expire_all_fragments
    @label = Label.find(params[:label][:id])

    respond_to do |format|
      if @label.update_attributes(params[:label])