app/controllers/packages_controller.rb

SELECT * FROM "packages" WHERE ("packages"."id" = 765)
---
  def edit
    @package = Package.find_by_name_and_task_id(unescape_url(params[:id]),
                                                find_task(params[:task_id]).id)
    if params.include?(:assignee)
      @package.assignee = User.find(params[:assignee])