app/controllers/packages_controller.rb

SELECT * FROM "packages" WHERE ("packages"."brew_tag_id" = 10 AND "packages"."name" = 'rhq') LIMIT 1
SELECT "p_attachments".* FROM "p_attachments" WHERE ("p_attachments".package_id = 1239)
SELECT * FROM "brew_tags" WHERE ("brew_tags"."name" = 'jb-eap-6-rhel-6-wolf') LIMIT 1
---
  def show
    respond_to do |format|
      format.html {
        @package = Package.find_by_name_and_brew_tag_id(unescape_url(params[:id]), BrewTag.find_by_name(unescape_url(params[:brew_tag_id])).id, :include => :p_attachments)
        if @package.blank?

SELECT * FROM "packages" WHERE ("packages"."brew_tag_id" = 1 AND "packages"."name" = 'rhino') LIMIT 1
---
  def edit
    @package = Package.find_by_name_and_brew_tag_id(unescape_url(params[:id]), BrewTag.find_by_name(unescape_url(params[:brew_tag_id])).id)

SELECT * FROM "packages" WHERE ("packages"."id" = 765)
SELECT * FROM "labels" WHERE ("labels"."id" IS NULL) LIMIT 1
UPDATE "packages" SET "label_changed_at" = '2012-10-29 10:13:55.571423', "updated_at" = '2012-10-29 10:13:55.581501' WHERE "id" = 765
---
  def update
    expire_all_fragments

    # for Changelog.package_updated
    @orig_package = Package.find(params[:id])
    @orig_marks = @orig_package.marks.clone

    @package = Package.find(params[:id])

    if @package.created_by.blank?
      params[:package][:created_by] = current_user.id
    end

    params[:package][:updated_by] = current_user.id

    last_label_changed_at = @package.label_changed_at
    last_label = Label.find_by_id(@package.label_id)

    unless params[:package][:name].blank?
      cleanup_package_name(params[:package][:name])
    end

    respond_to do |format|
      Package.transaction do
        if @package.update_attributes(params[:package])

SELECT * FROM "track_times" WHERE (package_id=765 and label_id=1)
---
          if Label.find_by_id(params[:package][:label_id].to_i) != last_label
            @package.label_changed_at = Time.now

            if !last_label.blank? && last_label.is_track_time == 'Yes'

SELECT * FROM "packages" WHERE ("packages"."brew_tag_id" = 1 AND "packages"."name" = 'rhino') LIMIT 1
---

          format.html { redirect_to(:controller => :packages, :action => :show, :id => escape_url(@package.name), :brew_tag_id => escape_url(@package.brew_tag.name), :user => params[:user]) }
        else
          unless @package.errors[:name].blank?