app/controllers/sessions_controller.rb

  def update
    redirect = '/'
    redirect = params[:session][:redirect]  if params[:session][:redirect]

    u = User.find_by_email(params[:session][:email].strip.downcase)
---
SELECT * FROM "users" WHERE ("users"."email" = 'weli@redhat.com') LIMIT 1